{"doc_id": "manual::11F3", "afsc": "11F3", "source": "manual_extraction", "doc_type": "AFOCD", "category": "Operations", "title": "FIGHTER PILOT", "page_start": 36, "page_end": 36, "text": "AFSC 11F4*, Staff \nAFSC 11F3*, Flight Lead \nAFSC 11F2*, Wingman \nAFSC 11F1*, Entry/Student \nFIGHTER PILOT \n(Changed 30 Apr 23) \n1. Specialty Summary. Pilots fighter aircraft and commands crews to accomplish combat, training, and other missions. Related DoD \nOccupational Group: 220100. \n2. Duties and Responsibilities: \n2.1. \nPlans and prepares for mission. Reviews mission tasking, intelligence, and weather information. Supervises mission planning, \npreparation and filing of flight plan, and crew briefing. Ensures aircraft is preflighted, inspected, loaded, equipped, and manned for \nmission. \n2.2. \nPilots aircraft and commands crew. Operates aircraft controls and equipment. Performs, supervises, or directs navigation, in-flight \nrefueling (except Q Suffix, IFF (AT-38/T-38C)), and weapons delivery. \n2.3. \nConducts or supervises training of crewmembers. Ensures operational readiness of crew by conducting or supervising mission \nspecific training. \n2.4. \nDevelops plans and policies, monitors operations, and advises commanders. Assists commanders and performs staff functions \nrelated to this specialty. \n3. Specialty Qualifications: \n3.1. \nKnowledge. Knowledge is mandatory of theory of flight, air navigation, meteorology, flying directives, aircraft operating \nprocedures, and mission tactics. \n3.2. \nEducation. For entry into this specialty, an undergraduate degree specializing in physical sciences, mathematics, administration, or \nmanagement is desirable. \n3.3. Training. The following training is mandatory as indicated: \n3.3.1. For entry into this specialty, completion of Air Force Specialized Undergraduate Pilot Training (SUPT). \n3.3.2. For award of AFSC 11F3X, completion of transition and operational training in the suffix specific aircraft. \n3.4. \nExperience. For upgrade to AFSCs 11F3X, unit commander determines proficiency based on performance, experience, and \ncompletion of minimum training requirements. \n3.5. Other. The following are mandatory as indicated: \n3.5.1. For award and retention of this AFSC, current aeronautical rating and qualification for aviation service as pilot. \n3.5.2. For award of AFSC 11F2X, certification of wingman qualification by appropriate operations authority. \n3.5.3. For award of AFSC 11F3X, certification of flight lead qualification by appropriate operations authority. \n3.5.4. Specialty requires routine access to Tier 5 (T5) information, systems or similar classified environments (except Q Suffix). For \naward and retention of AFSCs 11FXX, completion of a current T5 Investigation IAW DoDM 5200.02_AFMAN 16-1405, Air Force \nPersonnel Security Program. (Desirable for Q Suffix). \nNOTE: Award of the entry level without a completed T5 Investigation is authorized provided an interim Top Secret security clearance has \nbeen granted according to DoDM 5200.02_AFMAN 16 -1405. \n4. *Specialty Shredouts: \nSuffix \nPortion of AFS to Which Related \nB \nA-10 \nSuffix \nPortion of AFS to Which Related \nN \nF \nF-15 \nF-35 \nQ \nG \nF-15E \nIFF (AT-38/T-38C) \nU \nH \nF-16 \nAir Liaison Officer (ALO) \nY \nJ \nF-22 \nZ \nGeneral \nOther", "text_length": 3076, "notes": "None"}
{"doc_id": "manual::12B", "afsc": "12B", "source": "manual_extraction", "doc_type": "AFOCD", "category": "Operations", "title": "BOMBER COMBAT SYSTEMS OFFICER", "page_start": 46, "page_end": 46, "text": "AFSC 12B4*, Staff \nAFSC 12B3*, Qualified \nAFSC 12B2*, Intermediate \nAFSC 12B1*, Entry/Student \nBOMBER COMBAT SYSTEMS OFFICER \n(Changed 31 Oct 21) \n1. Specialty Summary. Performs duties of navigator, electronic warfare officer (EWO), or weapon systems officer (WSO) to accomplish \ncombat, training, and other assigned missions. Related DoD Occupational Group: 220400. \n2. Duties and Responsibilities: \n2.1. \nPlans and prepares for mission. Reviews mission tasking, intelligence, and weather information. Participates in mission planning, \npreparation and filing of flight plan, and crew briefing. Ensures aircraft is preflighted, inspected, loaded, equipped, and manned for \nmission. \n2.2. \n2.3. \nNavigates aircraft to accomplish assigned mission. Operates available navigation systems. \nConducts or supervises training of crewmembers. Ensures operational readiness of crew by conducting or supervising mission \nspecific training. \n2.4. \nDevelops plans and policies, monitors operations, and advises commanders. Assists commanders and performs staff functions \nrelated to this specialty. \n3. Specialty Qualifications: \n3.1. \nKnowledge. Knowledge is mandatory of theory of flight, air navigation, meteorology, flying directives, aircraft operating \nprocedures, and mission tactics. \n3.2. \nEducation. For entry into this specialty, an undergraduate degree specializing in physical sciences, mathematics, administration, or \nmanagement is desirable. \n3.3. Training. The following training is mandatory as indicated: \n3.4. \nFor entry into this specialty, completion of Air Force Specialized Undergraduate Navigator Training (SUNT) or Undergraduate \nCSO Training. \n3.4.1. For award of AFSC 12B2X/3X, completion of transition and operational training in the suffix specific aircraft. \n3.4.2. For award of AFSC 12B3C/D/W, completion of a EWO course or Undergraduate CSO Training. \n3.5. \nExperience. For upgrade to AFSCs 12B2X/3X, unit commander determines proficiency based on performance, experience, and \ncompletion of minimum training requirements. \n3.6. Other. The following are mandatory as indicated: \n3.6.1. For award and retention of these AFSCs, current aeronautical rating and qualification for aviation service as navigator. \n3.6.2. Specialty requires routine access to Tier 5 (T5) information, systems or similar classified environments. For award and retention of \nAFSCs 12BXX, completion of a current T5 Investigation IAW DoDM 5200.02_AFMAN 16-1405, Air Force Personnel Security \nProgram. \nNOTE: Award of the entry level without a completed T5 Investigation is authorized provided an interim Top Secret security clearance has \nbeen granted according to DoDM 5200.02_AFMAN 16 -1405. \n4. *Specialty Shredouts: \nSuffix \nPortion of AFS to Which Related \nC \nB-1 WSO \nSuffix \nPortion of AFS to Which Related \nW \nD \nB-52 EWO \nEWO, General \nY \nE \nB-52 WSO \nGeneral \nZ \nU \nAir Liaison (ALO) \nOther", "text_length": 2894, "notes": "None"}
{"doc_id": "manual::14N", "afsc": "14N", "source": "manual_extraction", "doc_type": "AFOCD", "category": "Intelligence", "title": "INTELLIGENCE", "page_start": 74, "page_end": 75, "text": "AFSC 14N4, Staff \nINTELLIGENCE \n \nAFSC 14N3, Qualified \nAFSC 14N1, Entry \n(Changed 30 Apr 21) \n1. Specialty Summary. Leads and performs intelligence activities across the full range of military operations supporting the Air Force’s \nService Core Function (SCF) of Global Integrated Intelligence, Surveillance and Reconnaissance (ISR). The Air Force conducts global \nintegrated ISR operations through a five-phase process commonly known by its acronym, PCPAD: planning and direction; collection; \nprocessing and exploitation; analysis and production; and dissemination. Additionally, ISR professionals conduct assessment, evaluation, \nand feedback throughout each phase. Air Force intelligence officers lead Airmen through the PCPAD process across four main areas, also \nknown as functional competencies: Analysis, Collection, Targeting, and Sensing Grid Activities. To execute these functional competencies \nintelligence officers utilize subject matter expertise in the six intelligence disciplines of geospatial intelligence (GEOINT), human \nintelligence (HUMINT), measurement and signature intelligence (MASINT), open source intelligence (OSINT), signals intelligence \n(SIGINT), and technical intelligence (TECHINT); utilize professional tradecraft to include assessment, counterdrug, counter proliferation, \ncounterterrorism, current intelligence, general military intelligence, indications and warning, irregular warfare and target intelligence; and \nintegrate thoroughly within cross functional capabilities, missions, and organizations to include airborne ISR, the Air Operations Center \n(AOC), the Air Support Operations Center (ASOC), cyberspace ISR, the Distributed Common Ground Station (DCGS), flying unit level \nsupport, force protection, information operations, space, and special operations forces (SOF). Finally, intelligence officers perform ISR \nenterprise management/staff functions to include acquisition, career broadening, doctrine, education and training, financial management, \nhuman capital/talent management, information technology, modeling and simulation, policy, research and technology, security, and \nstrategy. Related DoD Occupational Group: 230100. \n2. Duties and Responsibilities: \n2.1. \nDirects intelligence activities. Directs ISR activities and organizations and establishes goals and objectives. Reviews requirements \nfor objectives and relative priorities. Serves as the commander’s senior intelligence advisor. Directs preparation of intelligence budget \nestimates and financial plans. Implements standardization, evaluation, and training programs, and monitors compliance. \n2.2. \nDevelops intelligence plans and policies. Evaluates impact of legislative action, executive orders, regulations, directives, and \nmanagement decisions. Integrates intelligence activities into plans and programs. Develops and implements intelligence operations and \napplications policies, plans, concepts, systems, and orders for the intelligence disciplines, professional tradecraft, and integration with \ncross functional capabilities. Conducts force development, management and structure planning. \n2.3. \nManages and coordinates intelligence activities. Confers with government, business, professional, scientific, and other nations' \norganizations to provide support, exchange ideas, participate in studies, and coordinate on proposals and findings. Manages intelligence \nresponsibilities of the Department of Defense Planning, Programming, and Budgeting System. Coordinates with personnel, materiel, \nplanning, programming, and operational functions on allocation of resources, availability of funds, and preparation and implementation of \noperational plans. Supports weapon system acquisition. \n2.4. \nProduces timely and accurate fused intelligence analysis. Uses structured analytical techniques to convert processed information \ninto finished intelligence through the integration, evaluation, analysis, and interpretation of all-source data and the preparation of \nintelligence products in support of known or anticipated user requirements. Produces intelligence from the information gathered by the \ncollection capabilities assigned or attached to the joint force and from the refinement and compilation of intelligence received from \nsubordinate units and external organizations. Integrates, evaluates, analyzes, and interprets all processed information to create products \nthat will satisfy the commander’s priority intelligence requirements (PIRs) and requests for information (RFIs). \n2.5. \nConducts collection and ISR operations. Executes collection management by converting intelligence requirements into collection \nrequirements, establishing priorities, tasking or coordinating with appropriate collection sources or agencies, monitoring results, and re- \ntasking, as required. Conducts collection operations by directing, scheduling, and controlling specific collection platforms, sensors and \nHUMINT sources to include the physical operation of airborne systems (both manned and remotely piloted), space-based systems, cyber, \nnon-traditional ISR and HUMINT sources as well as near real time (NRT) coordination and control. Performs processing, exploitation, \nand dissemination by converting raw collection into forms that can be readily used by commanders, decision makers at all levels, \nintelligence analysts and other consumers. \n2.6. \nEmploys multi-domain sensing grid activities. Performs activities such as collection operations (sensing), analysis (identify and \nattribute), delivering information to customers, and collaborating with partners (sharing). Understands cloud technology, machine \nintelligence, and big data analytics combined with critical thinking skills to accelerate intelligence activities in a fast-paced, data-intensive \nenvironment where Airmen act as both producers and consumers of information. Understands how to operate within a collaborative \nsensing grid and use a common data environment to enable human-machine teaming and empower ISR Airmen to be more effective in \nsolving problems and delivering time-dominant intelligence. \n2.7. \nPerforms targeting functions. Performs targeting functions to include kinetic and non-kinetic target development, weaponeering, \nprecision point mensuration (PPM), force application, execution planning, and combat assessment. Selects and prioritizes targets and \nmatches appropriate actions to those targets to create specific desired effects that achieve objectives, taking account of operational \nrequirements and capabilities. Conducts analysis of enemy personnel, units, disposition, facilities, systems, and nodes relative to the \nmission, objectives, and the capabilities at the Joint Force Commander’s disposal, to identify and nominate specific centers of gravity \n(COG) and high-value targets (HVT) that, if exploited in a systematic manner, will create the desired effects and support accomplishment \nof the commander’s objectives. \n \n3. Specialty Qualifications: \n3.1. \nKnowledge. Knowledge is mandatory of intelligence fundamentals, security, analysis, communications skills, the intelligence \ndisciplines, the intelligence community, ISR information systems, research sources and methods, the presentation of friendly forces, \nfriendly weapons systems, adversary capabilities, ISR operations, targeting, integration, and sensing grid activities. \n3.2. \nEducation. For entry education requirements see Appendix A, 14N CIP Education Matrix. \n3.3. Training. The following training is mandatory for award of the AFSC indicated: \n3.3.1. 14N1. Completion of the Intelligence Officer Initial Skills Course.14N3. Completion of mission qualification, which includes but \nis not limited to IQT/MQT, mission certification, or other training deemed necessary to be considered qualified to perform assigned \nduties. (Note: Waivers for mandatory Intelligence Officer Initial Skills Course training must be submitted in accordance with AFMAN 36\n2100 and 14N Career Field Manager guidance.) \n3.4. \nExperience. The following experience is mandatory for award of the AFSC indicated: \n3.4.1. 14N3. Complete a minimum of 36 months performing intelligence functions. \n3.5. Other. \n3.5.1. For entry and retention in this specialty: \n3.5.1.1. \nSpecialty requires routine access to Tier 5 (T5) information, systems or similar classified environments. For award and \nretention of AFSCs 14NX, completion of a current T5 Investigation IAW DoDM 5200.02_AFMAN 16-1405, Air Force Personnel \nSecurity Program is mandatory. Access to T5 material is determined by favorable adjudication of the T5 updates, according to applicable \nsecurity and intelligence regulations. The Department of Defense Central Adjudication Facility (DoD CAF) is solely responsible for \ndetermining and certifying eligibility for access to T5 material. \n3.5.1.2. \nIn accordance with AFMAN 36-2100, revocation of eligibility for access to T5 information or systems requires a withdrawal of \n14NX AFSCs, unless an exemption is granted by HQ AFPC/DPMSSM on the recommendation of HQ USAF/A2/A6. Revocation of an \nofficer’s security clearance by AFCAF requires a withdrawal of 14NX AFSCs without exception. \nNOTE: Award of the entry level AFSC without a completed T5 Investigation is authorized provided an interim Top Secret security \nclearance has been granted according to DoDM 5200.02_AFMAN 16 -1405.", "text_length": 9364, "notes": "None"}
{"doc_id": "manual::14F", "afsc": "14F", "source": "manual_extraction", "doc_type": "AFOCD", "category": "Intelligence", "title": "INFORMATION OPERATIONS", "page_start": 71, "page_end": 72, "text": "AFSC 14F4, Staff \nAFSC 14F3, Qualified \nAFSC 14F1, Entry \n(Changed 31 Oct 23) \n1. Specialty Summary. Leads and applies social science principles across four functional competencies: analysis, planning, integration, \nand assessments throughout the full range of military operations to influence perceptions and behavior, and to drive action or inaction of \nrelevant actors. IO professionals coordinate, integrate, and synchronize information capabilities with military operations to achieve an \ninformation advantage over adversaries. 14F personnel leverage information and the integrated joint planning environment to achieve \ncommander's objectives in an increasingly pervasive, dynamic, and interconnected information environment (IE). Additionally, IO \nofficers possess core disciplines in Deception Activities, Military Information Support Operations (MISO), and Operations Security \n(OPSEC). Finally, IO officers perform IO management/staff functions to include acquisition, career broadening, doctrine production, \neducation and training, financial management, human capital/force management, information technology, modeling and simulation, \npolicy, research and technology, security, and strategy. \n2. Duties and Responsibilities: \n2.1. \nUses access to the Joint Worldwide Intelligence Communications System, Tier 5 (T5) information systems or similar \nclassified/privileged information environments to provide insight into adversary intentions, weaknesses, and potential vulnerabilities in a \ntimely manner that allows expedient operational design and faster completion of friendly observe, orient, decide, act (OODA) cycles. \nCharacterizes, forecasts, anticipates, and seizes the initiative in the IE to support the joint force commander’s decision superiority and \nintegrates IE outcomes with Operation Environment. Equips policy makers, planners, and targeteers with the tools to maintain or \ninfluence perceptions and attitudes that drive behavior and decision-making of key leaders, groups, and organizations, enhancing air \npower effects through the IE and increases permissibility of all operations, activities, and investments (OAI) across the spectrum of \nconflict and peacetime engagements. \n2.2. \nManages planning for flexible and adaptive operations through the joint planning process in support of higher headquarters’ and \ncommander’s objectives and desired effects. Identifies IO scope, planning support requirements, relevant aspects, and centers of gravity of \nthe physical, informational, and cognitive dimensions of the IE. Recognizes desired and undesired effects that support or degrade Joint \nForce Commander’s information objectives and recommends effects and activities that support tasks in the IE, while calculating 2nd and \n3rd order effects. Ensures consistency and credibility of actions, words, and deeds through comprehensive coordination. Understands the \nfundamental concepts, principles, and doctrine required to develop the air portion of a joint/combined campaign plan and ensure IO \nsupports the strategic end states. \n2.3. \nDirects the synchronized planning, execution, and assessment of kinetic and non-kinetic capabilities into the targeting cycle to \neffectively wage information warfare throughout the full spectrum of military operations. Provides considerations for targets that are \nvulnerable and susceptible to operations in the IE, capabilities that can be applied to achieve the desired effects of those operations, and \nhow to assess the results once those capabilities have been applied. Leads and develops kinetic and non-kinetic capability requirements as \npart of the effects-based approach to targeting for both preplanned and dynamic situations. Serves as the primary subject matter expert \nthroughout the target nomination and review process for human targets that, if engaged, will create a desired effect within the operational \nenvironment. \n2.4. \nDrives the coordination and integration of information capabilities with Service, Joint, and Interagency organizations. Advises \nleadership regarding implications, execution, analysis, theories and research findings relevant to the disciplines of Deception Activities, \nMISO, and OPSEC. Synchronizes and provides strategic guidance emphasizing the importance of informational and physical effects \nintegration within USAF and Joint operations during execution to shape the IE in support of military operations. \n2.5. \nLeads IO focused input to assessment plans and evaluates data to provide IO related assessment recommendations. Assesses the IE \nto identify decision makers, factors that guide the decision-making process, and infrastructure that supports and communicates decisions. \nAnalyzes a wide variety of scenario related products including reports, survey and polling information, and open-source documents and \nevaluates IO objective status based on developed measures of effectiveness (MOE) and MOE indicators. Identifies information capability \nshortfalls, changes in parameters and/or conditions in the IE, and resource issues that may impede joint IO effectiveness. Ensures that \ndesire effects in support of the commander’s objectives are well-defined, measurable and provide feedback to commanders, operators, and \nplanners as operations evolve. \n3. Specialty Qualifications: \n3.1. \nKnowledge. Knowledge of IO, MISO, Deception Activities, MILDEC, and OPSEC, including the application, integration and \nsynchronization of information capabilities to influence, disrupt, corrupt or usurp the decision making of selected audiences to create \ndesired effects. \n3.2. \nEducation. For entry education requirements for the 14FX AFSC, see Appendix A, 14FX CIP Education Matrix. \n3.3. Training. For award of AFSC 14F3, the following training is mandatory: \n3.3.1. Completion of Information Operations Professionals Course (IOPC); or \n3.3.2. Information Operations Integration Course (IOIC); and \n3.3.3. Information Operations Integration Course- Military Information Support Operations (IIC-MISO) or Psychological Operations \nQualification Course (POQC); and \n \n3.3.4. Air Force Operations Security Course (AFOC); or \n3.3.5. Similar courses as approved by the 14F Career Field Manager, Career Field Functional Manager, or Career Field Authority. \n3.4. \nExperience. The following experience is mandatory: \n3.4.1. For award of AFSC 14F3, a minimum of 36 months of experience in a 14FX position is mandatory. Experience must include \nassignments performing career field functions as described in paragraph 2, Duties and Responsibilities. \n3.4.1.1. \nA master's degree in one of the specified disciplines in Appendix A, 14FX CIP Education Matrix fulfills 12 months of the \nrequired 36-month requirement. \n3.4.1.2. \nA Doctor of Philosophy degree in one of the specified disciplines in Appendix A, 14FX CIP Education Matrix fulfills 18- \nmonths of the 36-month requirement. \n3.5. Other. Entry and retention in this specialty requires routine access to the Joint Worldwide Intelligence Communications System, \nTier 5 (T5) information, systems or similar classified environments. For award and retention of AFSC 14FX, adjudication of a current T5 \nInvestigation in accordance with DoDM 5200.02_AFMAN 16-1405, Air Force Personnel Security Program, is required. \nNOTE: Award of the entry level without a completed T5 Investigation is authorized provided an interim Top Secret security clearance has \nbeen granted according to DoDM 5200.02_AFMAN 16 -1405.", "text_length": 7466, "notes": "None"}
{"doc_id": "manual::21A", "afsc": "21A", "source": "manual_extraction", "doc_type": "AFOCD", "category": "Maintenance", "title": "AIRCRAFT MAINTENANCE", "page_start": 110, "page_end": 110, "text": "AFSC 21A4, Staff \nAFSC 21A3, Qualified \nAFSC 21A1, Entry \nAIRCRAFT MAINTENANCE \n(Changed 31 Oct 15, Effective 26 Feb 15) \n1. Specialty Summary. Leads, trains, and equips personnel supporting aerospace equipment sustainment and operations. Manages \nmaintenance and modification of aircraft and associated equipment. Administers aircraft maintenance programs and resources. Directs \naircraft maintenance production, staff activity, and related materiel programs. Assesses unit capability and advises senior leadership. \nRelated DoD Occupational Groups: 240400. \n2. Duties and Responsibilities: \n2.1. \nDirects aircraft maintenance mission generation and repair network activities. Maintains workforce discipline and responds to \npersonnel issues while balancing workforce availability and skill levels with operational requirements. Works with functional managers to \ndevelop, formulate, and manage fiscal resources. Instills maintenance discipline, security awareness and force protection concepts. \nEnsures accuracy of documentation, i.e., aircraft forms and automated systems. Ensures adherence to technical data, policy, procedures, \nand safe maintenance practices. \n2.2. \nDevelops, coordinates, and executes flying and maintenance schedules. Manages aircraft configuration; daily aircraft servicing, \nweapons loading, launch, recovery, and repair; periodic aircraft maintenance inspections; and flightline safety and foreign object damage \n(FOD) prevention and dropped object programs (DOP). Manages overall aircraft fleet health and ensures aircraft availability to execute \nmission requirements. Analyzes aircraft maintenance indicators to identify trends and initiates corrective actions. \n2.3. \nDirects maintenance activities that may include aircraft propulsion, pneudraulics, egress, fuel systems, electro-environmental, \nPrecision Measurement Equipment Laboratory (PMEL) and avionics systems. Also, may include management of aerospace ground \nequipment, structural repair, low-observable repair, corrosion control, machine, welding, inspection, aero-repair, crash, damaged, disabled \naircraft recovery, non-destructive inspection, and off-equipment munitions and armament suspension equipment. \n2.4. \nManages quality assurance, maintenance training, budget and resource management, analysis, facilities, shared resources to \ninclude end-of-runway and weapons load training. Manages plans and programs, modifications, and modernizations requirements. \n2.5. \nFormulates maintenance plans and policies to meet unit tasking. Assesses unit maintenance capability in support of combat related \noperational plans and provides inputs for capability assessments for each plan. Defines aircraft maintenance procedures and requirements \nin response to emergency or contingency situations. \n2.6. \nCoordinates core logistics requirements supporting aircraft maintenance operations. Establishes support requirements for supply \nrequisition, repair cycle, delivery, combat support, ground and aerial port transportation, base support plans, and munitions requirements. \n2.7. \nDirects and manages wholesale logistics life cycle sustainment support. Coordinates production schedules to include induction and \nselling systems. Defines technical problems and economic factors related to research and development, and system operational data to \nevaluate programs, assess trends, and identify improvements and deficiencies. Manages weapons system programs, funding of depot \nmaintenance workloads, and transportation distribution systems. Manages logistics tests and evaluation on new acquisition programs and \naircraft modifications. \n3. Specialty Qualifications: \n3.1. \nKnowledge. The following knowledge is mandatory for award of the AFSC: maintenance and personnel management procedures, \nand organizational and mission requirements; capabilities, limitations, and basic operating principles of aircraft systems and components; \ntheory of flight and airframe construction; life cycle sustainment, quality assurance; supply, transportation, logistics plans, contracting, \nflying operations, munitions, and other unit operations related to aircraft maintenance units. \n3.2. \nEducation. For entry education requirements see Appendix A, 21A CIP Education Matrix. \n3.3. Training. For award of the 21A3, completion of a formal AETC entry-level training course; minimum of 24 months assigned to a \n21A position (Group Commanders may extend this requirement), and completion of the education and training requirements specified in \nthe Aircraft Maintenance Officer Training Task List. \n3.4. \nExperience. For award of AFSC 21A3, a minimum of 24 months of experience managing aircraft maintenance activities is \nmandatory. \n3.5. Other. Not used.", "text_length": 4728, "notes": "None"}
{"doc_id": "manual::21M", "afsc": "21M", "source": "manual_extraction", "doc_type": "AFOCD", "category": "Maintenance", "title": "MUNITIONS AND MISSILE MAINTENANCE", "page_start": 111, "page_end": 112, "text": "AFSC 21M4*, Staff \nAFSC 21M3*, Qualified \nAFSC 21M1*, Entry \n(Changed 31 Oct 18) \n1. Specialty Summary. Manages maintenance and modification of conventional munitions, nuclear weapons, intercontinental ballistic \nmissiles (ICBM), and associated equipment. Administers weapons programs and resources. Directs nuclear weapons and conventional \nmunitions accountability, storage, and maintenance production, staff activities, and related material programs. Manages missile \nmaintenance activities at launch/missile alert facilities and launch control centers, including maintenance, repair, and inspection of missile \nsystems, nuclear certified support vehicles and equipment, and other associated support equipment (SE). Serves as munitions and missile \nmaintenance staff advisor to commanders. Related DoD Occupational Groups: 240500. \n2. Duties and Responsibilities: \n2.1. \nFormulates maintenance procedures for all munitions and missile systems. Builds integrated logistics support plans and develops \nmaintenance support structures to sustain maintenance and personnel. Manages storage and distribution of Air Force munitions. \nEstablishes training requirements and support standards of operational systems. Identifies and upgrades system deficiencies to meet \nmission requirements and enhance safety. \n2.2. \nAssesses operational requirements and environment. Advises commanders on risks associated with conventional munitions, \nnuclear weapons, and missile operations. Evaluates explosives and nuclear safety criteria and develops explosives site plans for storage, \nmovement, and operations of conventional munitions, nuclear weapons, and missiles. Conducts conventional munitions, nuclear weapons, \nand missile safety training. \n2.3. \nManages conventional munitions, nuclear weapons, and missile maintenance production. Recommends procedural and technical \nimprovements and modifications. Schedules resources to ensure required readiness. Enforces technical performance standards and ensures \nassigned work force is properly trained and equipped. Assesses unit capability and advises commanders, supervisors, and staff. Budgets \nand allocates resources. Coordinates with operational and support units to ensure equipment readiness and efficiency of assigned forces. \n2.4. \nFormulates maintenance plans. Plans and programs support requirements, modifications, and modernization. Defines technical \nproblems and economic factors related to research and development, and system application. Reviews maintenance and operational data \nto evaluate programs, assess trends, and identify improvements and deficiencies. \n2.5. \n2.6. \nPlans and directs munitions support for in-place and Air Expeditionary Force operations. \nPlans and organizes munitions and missile maintenance activities; provides space, tools, test equipment, and spare parts; \nestablishes workflow. Develops and improves methods and procedures for assembly, checkout, calibration, and analysis of aerospace \nsystems. Establishes performance standards for system assembly, checkout, and component replacement. \n2.7. \nManages and coordinates activities to support intercontinental ballistic missile (ICBM) launch readiness operations. Advises \ncommander on operational status of ICBM assets. Maintains liaison with manufacturers' representatives to solve maintenance and \nperformance problems. Coordinates lateral logistics activities to ensure supply, transportation, and funding are integrated to support \nmission requirements. Represents logistics in development of flight procedures, mission checklists, and mission flight rules. \n2.8. \nWrites munitions, nuclear weapon, and missile maintenance annexes to logistics plans. Provides weapon system data for \noperational and logistics support analysis. Monitors and evaluates contracted logistics and maintenance support activities. \n2.9. \nDevelops procedures for storing, assembling, delivering, inventory management, and testing conventional munitions, nuclear \nweapons, and missiles. \n2.10. Develops procedures for, and manages, routine disposal of common US munitions. \n2.11. Develops munitions accountability programs. Understands and manages all aspects of the Air Force munitions accountability \nsystem, including systems and procedures for financial accountability and auditability of assets. \n3. Specialty Qualifications: \n3.1. \nKnowledge. The following knowledge is mandatory for award of the AFSC indicated: \n3.1.1. 21M3A. Maintenance management procedures and organizational and mission requirements; capabilities, limitations, and basic \nweapons, weapons procedures, and quality assurance; supply, transportation, civil engineer, and other unit operations related to munitions, \nmissile, or aircraft maintenance units; conventional air-to-air missiles; air-to-ground weapons including guided, rocket- boosted, and \nunguided munitions; dispensers and submunitions; suspension and release equipment; fuses; wiring harnesses; loading procedures; safety \ntests; munitions (ground) handling equipment; maintenance management; production control and maintenance data collection procedures; \nand lateral logistics functions related to munitions maintenance. \n3.1.2. 21M3I. Missile and re-entry systems; suspension and release equipment; weapon employment; nuclear surety; joint nuclear \nprocedures; related test, handling, and support equipment; evolution of missiles; missile operations; solid and liquid rocket performance, \nmaintenance capabilities, limitations, and employment of missile equipment; and ICBM life cycle logistics. \n3.1.3. 21M3N. Nuclear weapons and warheads; nuclear armament systems; suspension and release equipment; nuclear weapons \nemployment; Munitions Accountable Systems Officer responsibilities; nuclear weapons maintenance, life cycle management, and \ninspections; nuclear surety; nuclear theory, effects, and components; nuclear weapons storage; nuclear weapons movement; nuclear \nweapons physical security; nuclear weapons transportation; nuclear weapons maintenance documentation, records and reports; and joint \nnuclear procedures. \n3.2. \n \nEducation. For entry education requirements see Appendix A, 21M CIP Education Matrix. \n3.3. Training. The following training is mandatory for award of the AFSC indicated: \n3.3.1. 21M1. Completion of the Munitions and Missile Maintenance Officer Fundamentals Course is mandatory and a prerequisite for \nattending specialty shredout courses. \n3.3.2. 21M1A. Completion of Conventional Munitions Officer Course. \n3.3.3. 21M1I. Completion of ICBM Maintenance Officer Course. \n3.3.4. 21M1N. Completion of Nuclear Maintenance Officer Course. \n3.4. \nExperience. The following experience is mandatory for award of the AFSC specialty shredout indicated: \n3.4.1. 21M3A. A minimum of 24 months experience managing conventional munitions maintenance activities and completion of Career \nField Education and Training Plan requirements are mandatory. Completion of the Combat Ammunition Planning and Production 9CAPP) \ncourse is required. \n3.4.2. 21M3I. A minimum of 24 months experience managing ICBM maintenance activities and completion of Career Field Education \nand Training Plan requirements are mandatory. \n3.4.3. 21M3N. A minimum of 24 months experience managing nuclear weapons maintenance activities and completion of Career Field \nEducation and Training Plan requirements are mandatory. Completion of the Nuclear Accountability Course is required within 24 months \nof assignment. \n3.5. Other. \n3.5.1. For entry into this specialty (ANG and AFRC officers exempt), accessions must be screened for eligibility and meet requirements \nof the Personnel Reliability Program (PRP) as outlined in the HQ AETC PRP prescreening guidance. \n3.5.2. Specialty requires routine access to Tier 5 (T5) information, systems or similar classified environments. For award and retention of \nAFSCs 21MXX, completion of a current T5 Investigation IAW DoDM 5200.02_AFMAN 16-1405, Air Force Personnel Security \nProgram. \nNOTE: Award of the entry level without a completed T5 Investigation is authorized provided an interim Top Secret security clearance has \nbeen granted according to DoDM 5200.02_AFMAN 16 -1405. \n4. *Specialty Shredouts: \nSuffix \nPortion of AFS to Which Related \nA \nConventional \nSuffix \nPortion of AFS to Which Related \nN \nI \nICBM \nNuclear", "text_length": 8322, "notes": ""}
{"doc_id": "manual::1A3X1", "afsc": "1A3X1", "source": "manual_extraction", "doc_type": "AFECD", "category": "Operations", "title": "MOBILITY FORCE AVIATOR", "page_start": 24, "page_end": 25, "text": "CEM Code 1A100* \nAFSC 1A192*, Senior Enlisted Leader \nAFSC 1A172*, Craftsman \nAFSC 1A152*, Journeyman \nAFSC 1A132*, Apprentice \nAFSC 1A112, Helper \nMOBILITY FORCE AVIATOR \n(Established 31 Oct 23) \n1. Specialty Summary. The Lead-MAJCOM for aircraft and mission set will determine the Mobility Force Aviator (MFA) performance \ntasks as outlined in Master Training Tasks/Task Training Lists associated with Mission Design Series crew positions. Performs preflight and \npost-flight of aircraft and aircraft systems. Receives cargo/passenger load briefings, checks placement of cargo/passengers against aircraft \nlimitations/restrictions, determines adequacy of cargo documentation. Supervises cargo/passenger loading and offloading activities. Services \naircraft (e.g. fuel, water, and hydraulics) and creates load plans for cargo and passengers. Determines and directs cargo placement and restraint \nequipment requirements. Computes aircraft take-off and landing data/weight and balance. Demonstrates use of aircrew flight equipment. \nAccomplishes passenger comfort activities during flight. Performs aircrew functions and other mission specific qualification duties to \ninclude the airdrop of personnel and equipment/cargo. Performs in-flight refueling aircrew functions and activities. Monitors and operates \ncomplex aircraft instrumentation systems during flight, to include engine and aircraft systems controls, panels, and indicators. Some missions \nrequire non-standard configurations and penetration into hostile/denied territories undetected utilizing night vision devices and terrain, \nfollowing procedures often in close proximity to other aircraft and operations on unprepared surfaces. The hazardous mission and training \nenvironment demands high degrees of attention, focus, professionalism, knowledge, skill, discipline, coordination, and stress management to \nsuccessfully and safely carry out. Related DoD Occupational Subgroup: 105000, 195000, and 105000. \n2. Duties and Responsibilities: \n2.1. \nPerforms aircraft inspections. Performs aircrew visual inspection; non-scheduled aircraft maintenance; and preflight, through- flight, \nand post flight inspections of aircraft away from home station. Accomplishes preflight and post- flight records and reports. Maintains aircraft \nforms and records during flight and while aircraft is away from home station. \n2.2. \nManages cargo and passenger load briefings. Accomplishes load planning of cargo and passenger loads if required. Supervises cargo \nand passenger loading for off-loading operations. Directs the placement of material handling equipment to accomplish cargo on/off loading \noperations. Ensures cargo and passengers are placed according to load plans. Determines cargo restraint requirements according to criteria and \ndirects and checks the application of cargo restraint equipment. Checks cargo/passenger loads against manifests. Determines and verifies \npassenger, cargo, fuel, and emergency and special equipment distribution and weight. Computes and applies aircraft weight and balance. \n2.3. \nComputes takeoff, climb, cruise, and landing data. Determines engine fuel consumption using airspeed, atmospheric data, charts, \ncomputer, or electronic calculator. Records actual aircraft performance data in flight engineer's log. \n2.4. \nOperates and monitors engine and aircraft systems controls and indicators according to flight manual procedures. Assists pilot or \nperforms engine starts, and monitors run-up, flight operations, and engine shutdown. Operates engine controls to provide desired efficiency \nand economy. Monitors engine instruments throughout period of operation. Controls, monitors, and regulates aircraft systems such as electric, \ncommunication, navigation, hydraulic, pneumatic, fuel, air conditioning, and pressurization; ventilation; auxiliary power unit; and lubrication \nsystems. Observes warning indicators and light for fire, overheat, depressurization, and system failure. Reports abnormal conditions to pilot \nand recommends corrective action. Monitors provides passenger comfort. Prepares and dispenses passenger meals, snacks, and refreshments. \nCompletes required aircraft forms documentation and border clearance requirements. Visually monitors aircraft clearances (interior and \nexterior), identifies proximal threats to the aircraft and initiates corrective actions (aircraft scanning). \n2.5. \nPerforms in-flight refueling aircrew duties. Checks forms for equipment status. Performs visual and operational check of air refueling \nand associated systems and equipment. Performs in-flight operational check of air refueling systems. Directs receiver aircraft into air refueling \nposition. Operates in-flight air refueling controls and switches to safely affect contact between tanker and receiver aircraft. Monitors control \npanel for proper operation of equipment during air refueling and advises receiver pilot of actions required to safely maintain position within \nthe air-refueling envelope. Keeps tanker pilot informed as to progress of air refueling operations. Performs emergency operations and \nprocedures as required for emergency off-load and on-load of fuel. \n2.6. \nEnsures availability of fleet service equipment and receives and stows in-flight meals. Accomplishes passenger briefings to include the \nuse of emergency equipment, evacuation procedures, and border clearance requirements. Demonstrates the use of passenger emergency \noxygen systems and life vests. Supervises passengers in-flight. Performs jumpmaster duties. \n2.7. \nConducts cargo and personnel airdrops according to directives. Attaches extraction parachutes to cargo and platforms. Inspects cargo \nand platforms, extraction systems and connects static lines. Checks tiedowns, parachutes, containers, suspension systems, and extraction \nsystems to ensure proper cargo extraction or release. Operates aircraft airdrop systems and supervises cargo and paratroopers exiting the \naircraft. \n3. Specialty Qualifications: \n3.1. \nKnowledge. Mandatory knowledge of: electrical, arithmetic, mechanical, navigation, communication, hydraulic, and pneumatic \nsystems applying to aircraft and related systems; flight theory; minor in-flight maintenance; aircraft emergency procedures; in-flight refueling \nsystem; using and interpreting diagrams, schematics, aircraft performance charts, loading charts, technical publications and flight manuals; \naircraft refueling systems; flying directives; weight and balance factors; cargo tie- down techniques; using survival equipment and oxygen; \n \nborder agency clearance; dispensing and preserving food aboard aircraft; and understanding types, capacities, and configuration of transport \naircraft. \n3.2. \nEducation. For entry into this specialty, completion of high school with course(s) in mechanics, mathematics, physics, computer \nprinciples, speech, and English is desirable. \n3.2.1. 1A112 Completion of Career Enlisted Aviator Preparatory School. \n3.2.2. 1A132. Completion of Initial Qualification Training for the assigned aircraft/crew-position and Initial Qualification Course and \naccompanying Certificate of Aircrew Qualification AF Form 8 in Mission Design Series. \n3.3. \nExperience. The following experience is mandatory for award of the AFSC indicated: \n3.3.1. 1A152. Qualification in and possession of AFSC 1A132. Also, experience is mandatory in functions such as aircraft and performance \nweight and balance computations, aircraft records maintenance, aircraft systems maintenance and inspections, inspecting, operating, and \ntroubleshooting in-flight refueling systems; preparing or verifying load plans; loading and unloading aircraft; and instructing passengers in the \nuse of emergency equipment and procedures, in-flight emergency procedures; using personal equipment and oxygen, communications; current \nflying directives; interpreting diagrams, loading charts, and applicable technical publications; border agency clearance requirements and \nforms; principles of dispensing and preserving food aboard aircraft; and cargo and personnel airdrop techniques and equipment; certify and \nmaintain Mission Ready (MR) and/or Combat Mission Ready (CMR) status; experience and understanding in aviation organizational \nfunctions and shops to include Training, Tactics, Scheduling, and Evaluations. \n3.3.2. 1A172. Qualification in and possession of AFSC 1A152. Also, experience is mandatory in performing or supervising functions such as \nflight engineer activities., inspecting, operating, and troubleshooting in-flight refueling systems; preparing or verifying load plans; loading and \nunloading cargo on aircraft; and instructing passengers in the use of emergency equipment and procedures, airdrop techniques; weight and \nbalance factors; arithmetic, emergency equipment and in-flight emergency procedures; personal equipment and oxygen use; communications; \ncurrent flying directives; interpreting diagrams, and applicable technical publications; border agency clearance requirements and forms; \nprinciples of dispensing and preserving food aboard aircraft; and cargo restraint techniques. Ability to supervise aviation organizational \nfunctions and shops to include Training, Tactics, Scheduling, and Evaluations. \n3.3.3. 1A192. Qualification in and possession of AFSC 1A172 and experience managing and directing Mobility Mission functions and \nactivities. \n3.4. \nOther: The following are mandatory as indicated: \n3.4.1. For entry into this specialty: \n3.4.2. See attachment 4 for entry requirements. \n3.4.3. For entry, award, and retention of these AFSCs: \n3.5. \nPhysical qualification for aircrew duty according to DAFMAN 48-123, Medical Examinations and Standards, Class III medical \nstandards. \n3.6. \n3.7. \nNormal depth perception as defined in DAFMAN 48-123. \nQualification for aviation service according to AFI 11-402, Aviation and Parachutist Service, Aeronautical Ratings and Aviation \nBadges. \n3.8. \n3.9. \nMust maintain eligibility to deploy and mobilize worldwide. \nHeight in accordance with DAFMAN 48-123 and as directed in the current Medical Standards Directory Section T. \n3.10. For award and retention of these AFSCs: \n3.11. Must maintain local network access IAW AFI 17-130, Cybersecurity Program Management and AFMAN 17-1301, Computer Security. \n3.12. Specialty requires routine access to Tier 3 (T3) information, systems or similar classified environments. \n3.13. Completion of a current T3 Investigation required IAW DoDM 5200.02, AFMAN 16-1405, Air Force Personnel Security Program. \n3.14. Must not be downgraded to Non-Mission Ready/Non-Combat Mission Ready (NMR/NCMR), or Unqualified (UQ) Status more than \nfour periods in a Ready Aircrew Program cycle due to events under the aircrew member’s control. \nNOTE: Award of the entry level without a completed T3 Investigation is authorized provided an interim Secret security clearance has been \ngranted according to DoDM 5200.02, AFMAN 16-1405. \n4. *Specialty Shredouts:\n Suffix \nA \nPrimary Aircraft \nSuffix \nC-5 Flight Engineer\n I \nPrimary Aircraft \nKC-10 Boom Operator \nB \nC-5 Loadmaster\n J \nKC-10 Flight Engineer \nC \nC-17 Loadmaster\n K E-8 Flight Engineer\n D \nC-130J Loadmaster\n L \nC-130H Flight Engineer\n E \nWC-130 Loadmaster \nN \nC-130H Loadmaster\n F \nG \nE-3 Flight Engineer\n O EC-130H Flight Engineer \nKC-46 Boom Operator \nZ \nData Mask Mobility Force \nAviator \nH \nKC-135 Boom Operator", "text_length": 11394, "notes": "I believe the 1A career field has been rebranded since at least 2024. The 1A3X1 career field wasn't within the document."}
{"doc_id": "manual::1C3", "afsc": "1C3", "source": "manual_extraction", "doc_type": "AFECD", "category": "Operations", "title": "ALL-DOMAIN COMMAND AND CONTROL OPERATIONS", "page_start": 45, "page_end": 47, "text": "CEM Code 1C300 \n \nAFSC 1C391, Superintendent \nAFSC 1C371, Craftsman \nAFSC 1C351, Journeyman \nAFSC 1C331, Apprentice \nAFSC 1C311, Helper \nALL-DOMAIN COMMAND AND CONTROL OPERATIONS \n(Changed 30 Apr 24) \n1. Specialty Summary. Manages and performs activities within fixed ground, mobile and airborne command and control (C2) facilities \nsuch as installation and expeditionary command posts (CP), operations centers, rescue coordination centers, and Higher Headquarters \nCommand Centers/Operations Centers. Provides command, control, communications, and information support throughout the full \nspectrum of operations to include peacetime, emergency and disaster situations, crisis, contingency, and war. Responsible for emergency \naction messages from the Chairman of the Joint Chiefs of Staff, Headquarters Air Force, Headquarters Space Force, or Combatant \nCommands. Disseminates time- sensitive critical information to senior leaders and support agencies. Establishes procedures for \nDepartment of the Air Force (DAF) Operational Reporting Program. Reports international treaty compliance information. Uses \ncommunications systems and consoles to affect positive control of assigned forces and weapons systems. Supports chemical, biological, \nradiological, and nuclear (CBRN), and conventional warning and reporting activities. AFSC Duty Identifier: C2OPS. Related DoD \nOccupational Subgroup: 125000. \n2. Duties and Responsibilities: \n2.1. \nPerforms Command, Control, and Communications (C3) actions to support National Defense, Homeland Security, and All-Domain \nAir and Space Force operations throughout the full spectrum of operations. Provides a single, consolidated C2 center to monitor mission \nexecution of wing/installation commander assigned or supported missions (to include tenant, joint, and combined missions) by fusion of \ndata from disparate C2 nodes across the installation (BDOC, EOC, AMOPS, etc.). Provides C2 of worldwide nuclear and conventional \nforces supporting Emergency Plans, Operations Orders, and Operations Plans. Coordinates the execution of Mission Type Orders (e.g., \nWarning Orders, Tasking Orders, Prepare to Deploy Orders, Planning Orders and Execution Orders). Supports joint force operations and \nJoint All Domain Operations (JADO) through the combined Joint All Domain C2 (CJADC2) concept. Facilitates C3 in support of the Air \nForce Emergency Management (EM) Program. Provides functional expertise to ensure synergy among the various components of the Air \nForce EM Program. Coordinates actions to ensure prompt response during EM operations including immediate mobilization of resources \nand participation of agencies and organizations. Liaisons communications/supports first responders to provide life-saving response support \nto base personnel. Receives, processes, and disseminates emergency action messages via voice and record copy systems. Encodes, \ndecodes, and transmits and relays presidential decisions to execute and terminate nuclear and conventional force operations at all levels of \ncommand, both on the ground and in-flight. Relays C2 instructions for diversion, recall, evacuation, recovery, and reconstitution of forces. \nCoordinates and executes search and rescue activities. Coordinates with other agencies and organizations during planning, executing, and \nevaluation phases of C2 operations. Executes Aerospace Control Alert mission as quick response launch authority for immediate intercept, \ninspection, influence, or defeat of potential airborne threats. Flight follows and manages aerospace resources and monitors mission status \nto include aircraft, aircrew support, transportation, maintenance support, fleet services, and passenger and cargo support. Monitors aircraft \nmovement and relays information between aircrews and operations centers. Coordinates mission delays with installation and external \nagencies. Monitors status of launch and space assets. Monitors status and location of key personnel to facilitate immediate \ncommunications with higher headquarters. Ensures proper use and control of resources and classified material. Develops and evaluates C2 \nOperations processes. Performs self-assessments. Ensures operational readiness and adherence to standards. Recommends actions to \ncorrect C2 Operations procedural deficiencies. Maintains and disseminates local and worldwide current and forecasted weather to include \nwatches, advisories and warnings to installation populace and aerospace resources. The functional organization for the exercise of mission \ncommand authority and direction by a properly designated commander over assigned and attached forces in the accomplishment of the \nmission. \n2.2. \nManages and executes the DAF Reporting Program. Prepares and submits Operational Reports (OPREP) and Commander’s Critical \nInformation Requirement (CCIR) reports, attainment/deviation reporting, nuclear execution reporting (NEREP), international treaty, and aerospace \nasset reports. Analyzes and disseminates information derived from DAF reporting. Establishes policy for operational and, if applicable, \ndefense readiness reporting to include developing procedures, maintaining databases, and training personnel. Ensures reported data is \ncurrent and accurate. \n2.3. \nOperates and monitors voice, data, and alerting systems. Develops operating instructions directing All-Domain C2 Operations and \nlateral agency C2 activities. Develops, maintains, and initiates procedures to save lives, protect resources, and rapidly disseminate time \nsensitive information. These procedures support situations such as suspected or actual sabotage nuclear incidents, natural disasters, aircraft \naccidents or incidents, evacuations, dispersal, and aerospace anomalies. Receives and disseminates time-critical information to and from \nthe commander to internal and external agencies during daily operations, natural disasters and wartime and contingency operations to \naffect positive control of assigned forces and weapons systems. Coordinates actions to ensure prompt response during disaster operations \n(pre-, trans-, and post-), including immediate activation and recall of all resources and participating agencies and organizations. Monitors \nactions to preserve life, minimize damage, and restore operations following natural disasters (trans- and post-), accidents, wartime attacks, \nand military operations other than war. Coordinates, directs, and monitors actions to allow continuation or restoration of vital functions and \n \noperations. Maintains operational status displays. Maintains proficiency in C2/CJADC2 systems and aircraft flight following and mission \nmanagement systems. Establishes manpower, communications, equipment, and facility requirements. Monitors and alerts local and base \nagencies of threats affecting the installation. \n2.4. \nMaintains Communications Security (COMSEC) to include receiving, safeguarding, utilizing, inventorying, issuing, and \ndestroying COMSEC material. Maintains personnel, information, operations, computer, emission, industrial and physical security \nprograms. \n2.5. \nPerforms administrative actions. Compiles and maintains entry authority lists. Coordinates and provides input to installation support \nplans. Maintains directives and daily events log. Updates and maintains national, HHQ, or installation key personnel rosters. Performs as \nthe Installation’s Emergency Mass Warning Notification (EMWN) program manager for mass notification systems. \n3. Specialty Qualifications: \n3.1. \nKnowledge. Knowledge is mandatory of: Air Force organization and administration; JADO; EM the National Incident \nManagement System (NIMS) and Air Force Incident Management System (AFIMS); C2 data systems and reporting; automated data \nprocessing equipment use, capabilities, and limitations; techniques of presenting data; data collection procedures and summary techniques; \npurpose of command post for preparing, executing, and controlling assigned forces; emergency actions and directives; command weapon \nsystems movement and transfer procedures; encode, decode; and authorization procedures used by command of assignment. \n3.2. \nEducation. For entry into this specialty, completion of high school or General Education Development Equivalency is mandatory. \nCourses in English or oral communication is desirable. \n3.3. Training. For award of the AFSC 1C331, completion of the Command and Control Operations Apprentice Course is mandatory. \n3.4. \nExperience. The following experience is mandatory for award of the AFSC indicated: \n3.4.1. 1C351. Qualification in and possession of AFSC 1C331. Also, experience performing functions of C2 operations. \n3.4.2. 1C371. Qualification in and possession of AFSC 1C351. Also, experience performing or supervising functions of C2 operations. \n3.4.3. 1C391. Qualification in and possession of AFSC 1C371. Also, experience managing and directing C2 Operations functions. \n3.5. Other. The following are mandatory as indicated: \n3.5.1. For entry into this specialty for initial accessions: \n3.5.1.1. \nMeet mandatory AFSC aptitude, physical profile, and citizenship entry requirements as identified in attachment 4. \n3.5.1.2. \n3.5.1.3. \n3.5.1.4. \n3.5.1.5. \nNOTE 1: Entry into AFSC 1C3X1 is not open to non-United States Citizens or members with dual-citizenship status. \nMust pass Reading Aloud Test as defined in current version of Medical Standards Directory (MSD). \nMust have a S-1 profile (for PULHES clearance) \nCompletion of the Command and Control operations Apprentice Course in residence is mandatory. \n3.5.2. For entry into this specialty for personnel in retraining status: \n3.5.2.1. \nRetrainees are only accepted IAW the following: E-1 through E-5 (no Time in Service (TIS) restrictions), E-6 (less than 12 \nyears TIS). SNCOs are not accepted without prior coordination of the 1C3 CFM. NOTE: TIS/grade restrictions do not apply to the ARC. \n3.5.2.2. \nMeet mandatory AFSC aptitude, physical profile, and citizenship entry requirements as identified in attachment 4. \n3.5.2.3. \n3.5.2.4. \n3.5.2.5. \nMust pass Reading Aloud Test as defined in current version of Medical Standards Directory (MSD). \nMust have an S-1 profile (for PULHES clearance). \nInterviewed and recommended by a 1C3 SNCO (retraining action needed for entry into 1C3X1 IAW AFMAN 10-207, \nCommand Posts.) NOTE: Retraining interview do not apply to the ARC. Must be screened for eligibility for Personnel Reliability \nAssurance Program (PRAP) as outlined in the HQ AETC PRP Prescreening Guidance and deemed a suitable candidate for follow-on \nPRAP duties. PRAP standards are outlined in DoDM 5210.42 DAFMAN 13-501, Nuclear Weapons Personnel Reliability Program (PRP). \n3.5.2.6. \nNOTE 1: AETC/A2N will only make recommendations for PRP, not for AFSC classification. Note 2: PRAP Screening does not \napply to the ARC. \n3.5.2.7. \nCompletion of the Command and Control Operations Apprentice Distance Learning Course is mandatory. \n3.5.3. For entry, award, and retention of these AFSCs: \n3.5.3.1. \nNo history or record of psychiatric hospitalization that results in unresolved diagnosis or prolonged medical treatment (or \nobservation) which precludes execution of daily AFSC duties and/or reasonable judgment. \n3.5.3.2. \nNo history or evidence of personality disorder, substance use disorder, emotional instability or impulsive behaviors as \ndiagnosed by a competent medical authority (examples include but are not limited to: alcohol/drug misuse, intentional self-injury, \ndifficulty controlling/intense anger or sadness, etc.) which precludes execution of daily AFSC duties and/or reasonable judgment. \n3.5.3.3. \nNo evidence or history of misconduct that resulted in a court martial conviction (examples include, but are not limited to: illicit \ndrug use, financial irresponsibility, physical or sexual assault, domestic violence, discrimination, harassment, threats, or reprisal, etc.). For \naward, waiverable on a case-by-case basis by the 1C3 CFM. \n3.5.3.4. \nMust have a S-1 profile (for PULHES clearance) for entry. For retention, Commanders should contact the 1C3 CFM, or their \nrespective 1C3 MFM, for questions on retaining a member in the 1C3 AFS. \n3.5.4. For award, and retention of these AFSCs: \n3.5.4.1. \nMust maintain certification according to AFMAN 10-207, Command Posts. \n3.5.4.2. \n3.5.4.3. \nMust obtain initial certification within 180 calendar days from date entered training. \nMust maintain local network access IAW 17-130, Cybersecurity Program Management and AFMAN 17-1301, Computer \nSecurity (COMPUSEC). \n3.5.4.4. \nSpecialty requires routine access to Tier 5 (T5) information, systems, or similar classified environments. Completion of a \ncurrent T5 Investigation IAW DoDM 5200.02, AFMAN 16-1405, Air Force Personnel Security Program. \n \n3.5.4.5. \n3.5.4.6. \nIndividuals with suspended clearances greater than 180 calendar days will be considered for removal from the AFSC. \nReclassified and/or retraining personnel may enter the career field with a Secret clearance. NOTE: Award of the entry level \nwithout a completed T5 Investigation is authorized provided an interim Top Secret security clearance has been granted according to \nDoDM 5200.02, AFMAN 16-405, Air Force Personnel Security Program. \n3.5.4.7. \nMust have a S-1 profile (for PULHES clearance). For retention, Commanders should contact the 1C3 CFM, or their respective \n1C3 MFM, for questions on retraining a member in the 1C3 AFS. \n3.5.4.8. \nNOTE: All AFSC withdrawals must be coordinated with HAF AF/A3TC", "text_length": 13513, "notes": "Includes these AFSCs-AFSC 1C391, Superintendent AFSC 1C371, Craftsman AFSC 1C351, Journeyman AFSC 1C331, Apprentice AFSC 1C311, Helper"}
{"doc_id": "manual::1N0", "afsc": "1N0", "source": "manual_extraction", "doc_type": "AFECD", "category": "Intelligence", "title": "ALL SOURCE INTELLIGENCE ANALYST", "page_start": 72, "page_end": 73, "text": "AFSC 1N071, Craftsman \nAFSC 1N051, Journeyman \nAFSC 1N031, Apprentice \nAFSC 1N011, Helper \nALL SOURCE INTELLIGENCE ANALYST \n(Changed 30 Apr 24) \n1. Specialty Summary. Performs/manages intelligence activities/functions including discovering, developing, evaluating, and providing \nintelligence information. Related DoD Occupational Subgroup: 124300. \n2. Duties and Responsibilities: \n2.1. \nSupports all aspects of Air Force operations by discovering, collating, analyzing, evaluating, and disseminating intelligence \ninformation. Produces all-source intelligence, situation estimates, adversarial nation, terrorist, insurgent threat studies, and other \nintelligence reports and studies. Advises commanders on force protection and intelligence information for US and Partner Nations. \nConducts intelligence debriefings of US and allied military personnel involved in combat operations. Prepares mission reports. \n2.2. \nConducts intelligence Training. Instructs military personnel on collecting and reporting requirements and procedures, recognition \ntechniques, and assessing offensive and defensive weapon system capabilities. Assists SERE (Survival Evasion Resistance and Escape) \nand Aircrew Flight Equipment personnel in training personnel recovery and code of conduct, when necessary. Collates intelligence and \noperations materials, and assembles final products for mission briefing, study, and use. \n2.3. \nProduces intelligence materials. Prepares, maintains, and presents intelligence displays, reports, and briefings. Discovers, compiles, \nevaluates, researches, analyzes, and disseminates intelligence information. Establishes intelligence collection requirements. Identifies and \nestablishes unit requirements for intelligence reference materials and maintains intelligence reference files and automated intelligence \ndatabases. Uses intelligence automated data systems to store, retrieve, display, and report intelligence information. \n2.4. \nPerforms support to mission planning and execution. Provides tailored collections planning, threat analysis, and intelligence \nexpertise necessary to develop detailed mission plans for air, space, cyberspace, and special operations. Provides current situational \nawareness and Intelligence, Surveillance and Reconnaissance (ISR) management for the accomplishment of the Air Tasking Order (ATO), \nIntegrated Tasking Order (ITO), Cyber Tasking Order (CTO) or Space Tasking Order (STO). Analyzes intelligence to support military \noperations. Assists in the performance of, targeting functions to include target development, weaponeering, force application, mission \nplanning, and combat assessment. \n2.5. \nSupport to Force Protection (FP). Provides FP intelligence support to commanders and their staffs through all source intelligence \nproducts and briefings, focusing on human threat capabilities, tactics, trends, courses of action and ongoing threats in the unit's Area of \nInterest or Area of Responsibility. Analyzes incoming intelligence for FP value and impact. Ensures FP is addressed in current intelligence \nbriefings, pre-mission, and pre-deployment briefings. Provides guidance for unit-level FP-related intelligence external and internal \nTraining. Participates in the installation-level Threat Working Group (TWG). Develops realistic human threat scenarios for exercises. \nResponsible for providing FP for at-home, in-transit, and deployed units. \n2.6. \nProcesses, exploits, and disseminates intelligence products and conducts analysis concerning threat countries or targets of interest \nvia written and/or verbal means. These products provide specificity and knowledge to commanders and national leaders to impact tactical \nthrough strategic level decision making processes. \n3. Specialty Qualifications: \n3.1. \nKnowledge. Knowledge is mandatory of: intelligence organizations and systems; collection and reporting systems, procedures, and \nmethods; intelligence information sources; techniques of identifying, collating, evaluating, and analyzing information; geographical and \ncultural aspects of foreign countries; current military capabilities and employment tactics of potential enemy offensive and defensive \nweapon systems; special operations forces tactics; techniques and procedures, and associated equipment, procedures for acquiring, \nupdating, and maintaining intelligence documents, maps, and charts; maps and charts use techniques; graphic, oral, and written \nintelligence presentation; support to targeting; capabilities and application of respective computer systems; security classification marking \nand control; US sensor systems; regional physical characteristics relative to radar significance; basic electromagnetic theory; and digital \nterrain and feature databases. \n3.2. \nEducation. For entry into this specialty, completion of high school or General Education Development equivalency, with courses in \nspeech, journalism, critical thinking, geography, modern world history, statistics, algebra, and geometry are desirable. \n3.3. Training. For award of AFSC 1N031, completion of the All Source Intelligence Apprentice Course is mandatory. \n3.3.1. For US Space Force, completion of the All Sourced Intelligence Apprentice Course and Space Warfighter Intelligence Formal Unit \nis mandatory until replaced by new courses as determined by US Space Force. \n3.4. \nExperience. The following experience is mandatory for award of AFSC indicated: \n3.4.1. 1N051. Qualification in and possession of AFSC 1N031. \n3.4.2. 1N071. Qualification in and possession of AFSC 1N051. \n3.5. Other. The following are mandatory as indicated: \n3.5.1. For entry into this specialty: \n3.5.1.1. \nNo speech disorders or noticeable communications deficiencies as defined by AFI 48-123, Medical Examinations and \nStandards. \n3.5.1.2. \n \nA minimum score of G53 and PSM 26 on the 1N0X1 Tailored Adaptive Personality Assessment System (TAPAS)/Armed \nServices Vocational Aptitude Battery (ASVAB) predictive success model (PSM) or a standalone score of G55 is required. \n3.5.1.3. \nSee attachment 4 for additional entry requirements. \n3.5.2. For award and retention of AFSC 1N0X1: \n3.5.2.1. \nWhen required for a current or future assignment, must successfully complete a Counter- Intelligence (CI) polygraph \nexamination and meet all customer access eligibility requirements. Airmen unable to access mission, systems and/or facilities after 12 \nmonths of investigation/security screening should be considered for change of assignment, retraining or separation. \n3.5.2.2. \nMust maintain local network access IAW AFI 17-130, Cybersecurity Program Management Systems and AFMAN 17-1301, \nComputer Security. \n3.5.2.3. \nSpecialty requires routine access to Tier 5 (T5) information, systems, or similar classified environment. \n3.5.3. For award and retention of AFSCs 1N031, 1N051, and 1N071: \n3.5.3.1. \nCompletion of a current T5 Investigation IAW DoDM 5200.02, AFMAN 16-1405, Air Force Personnel Security Program, is \nmandatory. \nNOTE: Initial attendance in 1N0X1 AFSC awarding course without a completed T5 investigation is authorized provided interim T5 \neligibility has been granted IAW Intelligence Community Directive (ICD) 704. Airmen who cannot obtain at least an interim T5 for \nprogrammed class-start are not eligible for entry into the AFSC.", "text_length": 7296, "notes": "None"}
{"doc_id": "manual::1N4", "afsc": "1N4", "source": "manual_extraction", "doc_type": "AFECD", "category": "Intelligence", "title": "CYBER INTELLIGENCE", "page_start": 82, "page_end": 83, "text": "AFSC 1N471*, Craftsman \nAFSC 1N451*, Journeyman \nAFSC 1N431*, Apprentice \nAFSC 1N411*, Helper \nCYBER INTELLIGENCE \n(Changed 31 Oct 23) \n1. Specialty Summary: Responsible for discovering and analyzing computer network data, recognizing and assessing usable intelligence \nfrom a variety of sources, and influencing offensive and defensive cyber operations. Conducts research and analysis on potential cyber \ntargets, including foreign nations, terrorist groups, and other entities that pose a threat to the United States. Develops offensive cyber \noperations to deny, degrade, disrupt, or destroy enemy networks and systems, including identifying vulnerabilities and developing exploit \nstrategies. Ensures that all offensive cyber operations are conducted in accordance with applicable laws, regulations, and military rules of \nengagement. Conducts penetration testing and vulnerability assessments to identify potential weaknesses in Air Force networks and \ninformation or weapons systems. Cyber Intelligence Analysts assist and advise leaders across the Air Force, United States Cyber \nCommand, the National Security Agency, and other partners within the Intelligence Community to plan, initiate, guide, and execute cyber \noperations. Related DoD Occupational Subgroups: 123200 and 124300. \n2. Duties and Responsibilities: \n2.1. \nGeneral duties: Provides cyber intelligence planning and operations support to cyberspace and computer network operations. \nSupports analytical aspects of various Air Force and Joint intelligence, surveillance, and reconnaissance operations by collating, analyzing, \nevaluating, and disseminating cyber intelligence information. Produces cyber technical products to include target assessments, adversary \nstudies of the cyberspace operational environment, situation reports, and other intelligence products as required. Utilizes all- source \nintelligence information to produce and present topical high-interest technical and operational intelligence briefings to all levels of \ncommand. Creates and maintains technical and operational databases using diverse computer hardware and software applications. \n2.2. \nComputer Network Operations: Conducts global collection, exploitation, and signals analysis critical to cryptologic and cyber \noperations missions. Counters emerging target technologies and gains new access to adversary communications. Exploits and maintains \naccess to worldwide networks. Delivers information in compliance with legal, policy, formatting, and timeliness requirements. Utilizes \ndigital network analysis to conduct computer network exploitation operations on foreign targets that directly enable computer network \ndefense of critical US systems and infrastructure. Provides projection of power capabilities to commanders across US major commands. \n2.3. \nCyberspace Operations: Provides key intelligence enabling offensive and defensive cyberspace operations for US Cyber \nCommand. Conducts analysis of metadata, target analysis, and target research. Identifies target communications within global networks \nand conducts target technology trends research. Performs global network analysis and mapping, to include technology, activities, and \ncommunications, in order to determine target traffic behavior patterns. Analyzes exploitation opportunities for information systems and \ninfrastructure. Utilizes methods and applications of tools used for exploitation and analysis of computer systems and network \nvulnerabilities. Provides intelligence planning and operations support for target delivery, development, and reporting for cyberspace \noperations. \n2.4. \nIntelligence Training Supporting Cyber Operations: Instructs military personnel on cyber intelligence collection, analysis, and \nreporting requirements and procedures. Collates intelligence and operations materials to impart proper tradecraft supporting air, space, and \ncyberspace signals intelligence analysis. Drives development of discovery and tradecraft to broadly enable cryptologic, DoD, and Air \nForce missions. Integrates information assurance, cyber, cryptologic authorities, and data to evolve development of tradecraft and generate \nmeasurable mission outcomes. \n2.5. \nProcesses, exploits, and disseminates intelligence products and conducts analysis concerning threat countries or targets of interest \nvia written and/or verbal means. These products provide specificity and knowledge to commanders and national leaders to impact tactical \nthrough strategic level decision making processes. \n2.6. \nCyber Network Defense and Malware Analysis: Utilizes various analytical tools and techniques to identify and track potential \ncyber threats, malware, and malicious cyber actors. Collaborates with intelligence analysts, network defenders, and information \ntechnology professionals to ensure timely and accurate discovery and reporting of cyber threats to Department of Defense and Intelligence \nCommunity stakeholders \n3. Specialty Qualifications: \n3.1. \nKnowledge. Must gain and maintain knowledge of global communications procedures; analytical techniques; organization of the \nnational intelligence structure; intelligence organizations and systems; Information Operations; organization of designated military forces; \ngeography; collection and reporting, systems, principles, methods, and procedures; effective writing principles; oral and written \nintelligence information presentation; and directives for handling, disseminating, and safeguarding classified information. \n3.2. \nEducation. For entry into this specialty, completion of high school with courses in composition, speech, English, geography, world \nhistory, statistics, algebra, geometry, and computer applications is desirable. \n3.3. Training. The following training is mandatory for award of the AFSC indicated: \n3.3.1. 1N431A. Completion of the Digital Network Analysis Fundamentals course and Joint Cyber Analysis course. \n3.3.1.1. \nFor U.S. Space Force, completion of the Digital Network Analysis Fundamentals course, Joint Cyber Analysis course and \nSpace Warfighter Intelligence Formal Training Unit is mandatory until replaced by new courses as determined by US Space Force. \n3.4. \n \nExperience. The following experience is mandatory for award and retention of the AFSC indicated: \n3.4.1. 1N451A. Qualification in and possession of AFSC 1N431A and experience performing cryptologic activities. \n3.4.2. 1N471A. Qualification in and possession of AFSC 1N451A and experience performing or supervising cryptologic activities. \n3.5. Other. The following are mandatory as indicated: \n3.5.1. For entry into this specialty: \n3.5.1.1. \nNo speech disorders or noticeable communications deficiencies as defined by AFI 48-123, Medical Examinations and \nStandards. \n3.5.1.2. \nMust obtain a minimum score of 46 required on the Tailored Adaptive Personality Assessment System (TAPAS)/ Armed \nServices Vocational Aptitude Battery (ASVAB) selection model. \n3.5.1.3. \nSee attachment 4 for additional entry requirements. \n3.5.2. For award and retention of AFSC 1N4X1X, the following are mandatory: \n3.5.2.1. \nWhen required for a current or pending assignment, must successfully complete and pass a Counter-Intelligence (CI) polygraph \ntest and meet all customer access eligibility requirements. Airmen unable to access mission, systems and/or facilities after 12 months of \ninvestigation/security screening will be considered for retraining or separation. \n3.5.2.2. \nSecurity. \n3.5.2.3. \nMaintain local network access IAW AFI 17-130, Cybersecurity Program Management and AFMAN 17-1301, Computer \n1N451A and 1N471A. Completion of the Joint Cyber Analysis course for RegAF (effective 1 Aug 2019 for Air Force Reserve \ncomponent) airmen is mandatory for those in grades TSgt (E-6) and below with less than 15 years of time in service. \n3.5.2.4. \nSpecialty requires routine access to Tier 5 (T5) information, systems, or similar classified environment. \n3.5.2.5. \nCompletion and favorable adjudication of a current T5 Investigation IAW DoDM 5200.02, AFMAN 16-1405, Air Force \nPersonnel Security Program, is mandatory. \nNOTE: Initial attendance in 1N4X1A AFSC awarding course without a completed T5 clearance is authorized provided an interim T5 \nclearance eligibility has been granted IAW Intelligence Community Directive (ICD) 704. Airmen who cannot obtain at least an Interim T5 \nclearance for programmed class-start are not eligible for entry into the AFSC. \n4. Specialty Shredouts: \nSuffix \nPortion of AFS to Which Related \nA \nAnalyst", "text_length": 8519, "notes": "None"}
{"doc_id": "manual::2A3", "afsc": "2A3", "source": "manual_extraction", "doc_type": "AFECD", "category": "Maintenance", "title": "TACTICAL AIRCRAFT MAINTENANCE", "page_start": 123, "page_end": 124, "text": "AFSC 2A373, Craftsman \nAFSC 2A353*, Journeyman \nAFSC 2A333*, Apprentice \nAFSC 2A313*, Helper \nTACTICAL AIRCRAFT MAINTENANCE \n(Changed 31 Oct 21) \n1. Specialty Summary. Maintains tactical aircraft, support equipment, and forms and records. Performs and supervises flight chief, \nexpediter, crew chief, repair and reclamation, quality assurance, and maintenance support functions. Related DoD Occupational Subgroup: \n160000. \n2. Duties and Responsibilities: \n2.1. \nServices aircraft. Performs end-of-runway, ground handling postflight, preflight, thru-flight, special inspections, and phase \ninspections. Performs sortie generation operations and hot pit refuels. Advises on problems maintaining, servicing, and inspecting aircraft \nand related aerospace equipment. Uses conventional or automated technical data to diagnose and solve maintenance problems on aircraft \nsystems. Interprets and advises on maintenance procedures and policies to repair aircraft and related equipment. \n2.2. \nTroubleshoots and maintains aircraft engines, hydraulic, and other related systems, structures, components, and related equipment. \nRemoves and installs aircraft and engine components. Conducts functional tests of repaired engines, components, and systems. Adjusts, \naligns, and rigs aircraft systems. Supervises and performs aircraft jacking, lifting, and towing operations. \n2.3. \nInspects aircraft structures, engines, systems, components, and related systems. Supervises and performs aircraft, engine, and \ncomponent inspections. Interprets inspection findings and determines adequacy of corrective actions. Inspects and checks components for \nclearances, tolerances, proper installation, and operation. Inspects and operates powered and nonpowered aerospace ground equipment. \nInspects and identifies aircraft corrosion for prevention and repair. Reviews maintenance forms, aircraft records, automated maintenance \ndata systems, and historical reports to ensure complete documentation. Inventories and maintains aircraft equipment. \n2.4. \nPerforms flight chief, production superintendent, expediter, crew chief, repair and reclamation, and maintenance support functions. \nCoordinates maintenance plans and schedules to meet operational commitments. Supervises and assists in launching and recovering \naircraft. Reviews maintenance data collection summaries to determine trends and production effectiveness. Performs crash recovery \nduties. Performs staff and supervisory management functions. \n3. Specialty Qualifications: \n3.1. \nKnowledge. Knowledge is mandatory of: principles applying to aircraft systems; flight theory; hydraulic principles; electrical \ntheory; principles, concepts, and application of maintenance directives and data reporting; using technical data; technical order use; Air \nForce supply and deficiency reporting procedures; and proper handling, use, and disposal of hazardous waste and materials. \n3.2. \nEducation. For entry into this specialty, completion of high school courses in physics, pneudraulics, and electronics is desirable. \n3.3. Training. \n3.3.1. For award of AFSC 2A333X, completion of a suffix specific basic aircraft maintenance course is mandatory. \n3.3.2. For award of AFSC 2A373, complete craftsman aircraft maintenance course, if applicable. \n3.4. \nExperience. The following experience is mandatory for award of the AFSC indicated: \n3.4.1. 2A353X. Qualification in and possession of AFSC 2A333X. Also, experience in functions such as repairing and maintaining \naircraft or related installed equipment. \n3.4.2. 2A373. Qualification in and possession of AFSC 2A353X. Also, experience performing or supervising functions such as installing, \ninspecting, repairing, or overhauling aircraft structures, systems, and components. \n3.5. Other. The following are mandatory as indicated: \n3.5.1. For entry into this specialty: \n3.5.1.1. \nNormal color vision as defined in AFI 48-123, Medical Examinations and Standards. \n3.5.1.2. \nSee attachment 4 for additional entry requirements. \n3.5.2. For award and retention of these AFSCs: \n3.5.2.1. \nMust maintain local network access IAW AFI 17-130, Cybersecurity Program Management and AFMAN 17-1301, Computer \nSecurity. \n3.5.2.2. \nFor award and retention of AFSCs 2A3X3/X, completion of a current Tier 3 (T3) Investigation required IAW DoDM 5200.02, \nAFMAN 16-1405, Air Force Personnel Security Program, is mandatory. \nNOTE: Award of the entry level without a completed T3 Investigation is authorized provided an interim Secret security clearance has \nbeen granted according to DoDM 5200.02, AFMAN 16 -1405. \n4. *Specialty Shredouts: \nSuffix \nPrimary Aircraft \nE \nA-10/U-2 \nL \nF-15 \nM \nF-16 \nNOTE: Suffixes are applicable to the 1-, 3-, and 5- skill levels only.", "text_length": 4732, "notes": "None"}
{"doc_id": "manual::2A5", "afsc": "2A5", "source": "manual_extraction", "doc_type": "AFECD", "category": "Maintenance", "title": "AIRLIFT/SPECIAL MISSION AIRCRAFT MAINTENANCE", "page_start": 131, "page_end": 132, "text": "AFSC 2A571, Craftsman \nAFSC 2A551*, Journeyman \nAFSC 2A531*, Apprentice \nAFSC 2A511*, Helper \n★AIRLIFT/SPECIAL MISSION AIRCRAFT MAINTENANCE \n(Changed 31 Oct 24) \n1. Specialty Summary. Maintains aircraft, support equipment, forms, and records. Performs and supervises flight chief, expediter, crew \nchief, repair and reclamation, quality assurance and maintenance support functions. Related DoD Occupational Subgroup: 160000. \n2. Duties and Responsibilities: \n2.1. \nPerforms sortie generation, ground handling, and servicing operations. Performs aircraft inspections such as preflight, thru-flight, \npostflight, hourly postflight, special inspections, and isochronal inspections. Advises on problems, maintenance, servicing, and inspection \nof aircraft and related aerospace equipment. Uses technical data to diagnose and solve maintenance problems on aircraft systems. \nInterprets and advises on maintenance procedures and policies to repair aircraft and related equipment. \n2.2. \nInspects, troubleshoots, and maintains aircraft structures, engines, hydraulic, and other related systems, components, and \nequipment. Removes and installs aircraft and engine components. Conducts operational checks and repairs components and systems. \nPerforms ground engine operation. Adjusts, aligns, and rigs aircraft systems. Accomplishes weight and balance functions. Supervises and \nperforms aircraft jacking, lifting, and towing operations. \n2.3. \nSupervises and performs aircraft, engine, and component inspections. Interprets inspection findings and determines adequacy of \ncorrective actions. Inspects and checks components for clearances, tolerances, proper installation, and operation. Performs pre-use \ninspections and operates powered and non-powered aerospace ground equipment. Inspects and identifies aircraft corrosion for prevention \nand repair. Reviews maintenance forms, aircraft records, automated maintenance data systems, and historical reports to ensure complete \ndocumentation. Inventories and maintains alternate mission equipment. Inventories and maintains aircraft equipment. \n2.4. \nCoordinates maintenance plans and schedules to meet operational requirements. Supervises and assists in launching and recovering \naircraft. Reviews maintenance data collection summaries to determine trends and production effectiveness. Performs crash recovery \nduties. Performs staff and supervisory management functions. \n3. Specialty Qualifications: \n3.1. \nKnowledge. Knowledge is mandatory of: principles applying to aircraft systems; flight theory; hydraulic principles; electrical \ntheory; principles, concepts, and application of maintenance directives and data reporting; using technical data; Air Force supply and \ndeficiency reporting procedures; and proper handling, use, and disposal of hazardous waste and materials. \n3.2. \nEducation. For entry into this specialty, completion of high school is mandatory. Completion of related vocational courses is highly \ndesirable. \n3.3. Training. \n3.3.1. For award of AFSC 2A531X, completion of a suffix specific basic aircraft maintenance course is mandatory. \n3.3.2. For award of AFSC 2A571, complete craftsman aircraft maintenance course, if applicable. \n3.4. \nExperience. The following experience is mandatory for award of AFSC indicated: \n3.4.1. ★2A551. Qualification in and possession of AFSC 2A531X or previous award of 2A338X. \n3.4.2. ★2A571. Qualification in and possession of AFSC 2A551 or previous award of 2A358X. \n3.5. Other. The following are mandatory as indicated: \n3.5.1. For entry into this specialty: \n3.5.1.1. \nNormal color vision as defined in AFI 48-123, Medical Examinations and Standards. \n3.5.1.2. \nSee attachment 4 for additional entry requirements. \n3.5.2. For award and retention of these AFSCs: \n3.5.2.1. \nMust maintain local network access IAW AFI 17-130, Cybersecurity Program Management and AFMAN 17-1301, Computer \nSecurity. \n3.5.2.2. \nSpecialty requires routine access to Tier 3 (T3) information, systems, or similar classified environment. For award and retention \nof AFSCs 2A5X1/X, completion of a current T3 Investigation required IAW DoDM 5200.02, AFMAN 16-1405, Air Force Personnel \nSecurity Program, is mandatory. \nNOTE: Award of the entry level without a completed T3 Investigation is authorized provided an interim Secret security clearance has \nbeen granted according to DoDM 5200.02, AFMAN 16 -1405. \n4. *Specialty Shredouts: \nSuffix \nPrimary Aircraft \nA \nC-20/C-21/C-22/C-37/C-40/E-4/VC- 25 \nSuffix \nPrimary Aircraft \nC \nC-5 \nB \nC-130/C-27J \nMQ-1/9 \nD \nC-17 \n★M \n★R \nRQ-4 \nNOTE: Suffixes are applicable to the 1-, and 3 skill levels only.", "text_length": 4626, "notes": "None"}
